Autodesk.Revit.DB.BackClippingParam
The allowed values for the VIEW_BACK_CLIPPING and VIEWER_BOUND_FAR_CLIPPING parameters.

Autodesk.Revit.DB.BackClippingParam.ClipNoLine
Clip without line.

Autodesk.Revit.DB.BackClippingParam.ClipWithLine
Clip with line.

Autodesk.Revit.DB.BackClippingParam.NoClip
No clip